app/Controllers/gaji.php

SELECT *
FROM `karyawan`
SELECT *
FROM `bagian`
---
    public function edit($id)
    {
        $karyawan = $this->karyawanModel->findAll();
        $bagian = $this->bagianModel->findAll();