app/Controllers/transaksi.php

    public function indexmtkl4()
    {
         // Mengambil total saldo yang disetujui
         $totalSaldoDisetujui = $this->transaksiModel->gettotalSaldoDisetujui('112');

         // Mengirim data transaksi dan total saldo yang disetujui ke view
         $data = [
             'transaksi' => $this->transaksiModel->where('nip', '112')->findAll(),
             'totalSaldoDisetujui' => $totalSaldoDisetujui['jumlah'] ?? 0, // Mengambil jumlah dari hasil query
             'gaji' => $this->gajiModel->findAll()
---
SELECT *
FROM `gaji`