app/Models/gajiModel.php

SELECT *
FROM `gaji`
SELECT *
FROM `gaji`
WHERE `id` = '1686'
 LIMIT 1
---
    public function getgaji($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }
        return $this->where(['id' => $id])->first();